# =========================
# تمرین: دفترچه تلفن (Phone Book)
# =========================

# ساختار هر مخاطب:
# {
#   "name": "...",
#   "phone": "...",
#   "isFavorite": True/False
# }


# 1) ساخت دفترچه تلفن
# یک لیست خالی بساز و چند مخاطب با input داخل آن ذخیره کن


# 2) نمایش همه مخاطب‌ها
# همه مخاطب‌ها را یکی یکی چاپ کن


# 3) جستجو بر اساس نام
# یک name بگیر و مخاطب مربوطه را پیدا کن


# 4) حذف مخاطب
# با گرفتن name، مخاطب را از لیست حذف کن


# 5) اضافه کردن مخاطب جدید
# هر بار name و phone بگیر و به لیست اضافه کن


# 6) نمایش فقط مخاطب‌های favorite
# فقط کسانی که isFavorite == True هستند را چاپ کن


# 7) شمارش مخاطب‌ها
# تعداد کل مخاطب‌ها را چاپ کن


# 8) جلوگیری از شماره تکراری
# اگر phone قبلاً وجود داشت، اجازه اضافه شدن نده


# 9) تغییر شماره یک مخاطب
# با گرفتن name، شماره را آپدیت کن


# 10) منوی دفترچه تلفن
# 1) add contact
# 2) delete contact
# 3) search contact
# 4) show all
# 5) exit
# با while True اجرا شود